{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Society & Culture",
    "1": "Science & Mathematics",
    "2": "Health",
    "3": "Education & Reference",
    "4": "Computers & Internet",
    "5": "Sports",
    "6": "Business & Finance",
    "7": "Entertainment & Music",
    "8": "Family & Relationships",
    "9": "Politics & Government"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Business & Finance": 6,
    "Computers & Internet": 4,
    "Education & Reference": 3,
    "Entertainment & Music": 7,
    "Family & Relationships": 8,
    "Health": 2,
    "Politics & Government": 9,
    "Science & Mathematics": 1,
    "Society & Culture": 0,
    "Sports": 5
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
